testsrc/main/mondrian/xmla/excel_XP/excel_XP_02_in.xml

<?xml version="1.0"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Header>
    <BeginSession mustUnderstand="1" xmlns="urn:schemas-microsoft-com:xml-analysis"/>
    <NamespaceCompatibility mustUnderstand="0" xmlns="http://schemas.microsoft.com/analysisservices/2003/xmla"/>
  </Header>
  <Body>
    <Discover xmlns="urn:schemas-microsoft-com:xml-analysis">
      <RequestType>DISCOVER_SCHEMA_ROWSETS</RequestType>
      <Restrictions/>
      <Properties>
        <PropertyList>
          <LocaleIdentifier>1033</LocaleIdentifier>
          <DataSourceInfo>MondrianFoodMart</DataSourceInfo>
          <Content>SchemaData</Content>
          <Format>Tabular</Format>
        </PropertyList>
      </Properties>
    </Discover>
  </Body>
</Envelope>
